// pages/doctor2/index.js

const pages = {
  1: {
    title: "饮食与营养",
    text: [
      "了解健康饮食的重要性，探索平衡膳食和营养素的丰富来源。",
      "我们为您提供专业的饮食建议，助您养成健康的饮食习惯和生活方式。",
      "探索各种饮食方案，了解如何满足您的营养需求，并提供您和家人的食谱建议。",
    ],
  },
  2: {
    title: "健身与运动",
    text: [
      "探索身体活动的益处，了解如何制定合适的健身计划，提升身体素质。",
      "我们提供专业的运动指导，帮助您选择适合您的健身项目和锻炼方法。",
      "了解不同类型的运动，从有氧运动到力量训练，为您的身体带来全面的健康益处。",
    ],
  },
  3: {
    title: "心理健康",
    text: [
      "关注心理健康，了解如何管理压力、焦虑和情绪问题，提升心理幸福感。",
      "我们提供心理咨询和支持，帮助您应对挑战，建立积极的心理健康策略。",
      "探索心理健康的重要性，学习平衡工作、生活和情感的技巧，迈向更健康的生活。",
    ],
  },
  4: {
    title: "疾病预防",
    text: [
      "了解常见疾病的预防方法和风险因素，提前采取措施保护您的健康。",
      "我们提供针对不同年龄段和人群的疾病预防建议，帮助您预防疾病和保持健康。",
      "探索疫苗接种、定期筛查和生活习惯的重要性，为您提供全方位的疾病预防指南。",
    ],
  },
  5: {
    title: "慢性病管理",
    text: [
      "了解慢性疾病的管理方法，学习如何控制病情、减轻症状并改善生活质量。",
      "我们提供个性化的慢性病管理方案，帮助您更好地管理糖尿病、高血压等慢性疾病。",
      "了解药物治疗、饮食调整和运动计划等综合治疗手段，为您提供全方位的慢性病管理支持。",
    ],
  },
  6: {
    title: "妇女健康",
    text: [
      "关注女性健康问题，了解常见妇科疾病、月经周期和更年期的变化。",
      "我们提供专业的妇女健康咨询，包括生殖健康、妊娠保健和乳腺保健等方面。",
      "探索女性健康问题的预防和管理方法，了解如何维护身心健康，享受优质生活。",
    ],
  },
  7: {
    title: "儿童健康",
    text: [
      "关注儿童健康成长，了解儿童的营养需求、免疫接种和常见疾病预防。",
      "我们提供专业的儿童健康咨询，包括生长发育、行为管理和常见疾病的识别与治疗。",
      "了解如何培养健康的生活习惯、提高免疫力，并为孩子提供全面的健康保护。",
    ],
  },
  8: {
    title: "健康老年",
    text: [
      "关注老年健康，了解老年人常见疾病、护理和健康管理的重要性。",
      "我们提供专业的老年健康咨询，包括年龄相关疾病的预防、药物管理和生活质量提升。",
      "了解如何保持健康的老年生活，延缓衰老、保护认知功能和促进身心健康。",
    ],
  },
};

Page({

  /**
   * 页面的初始数据
   */
  data: {
    top: 0,
    height: 0,

    title: '',
    text: []
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {
    const data = pages[options.id || 1]
    this.setData({
      title: data.title,
      text: data.text
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {
    const res = wx.getMenuButtonBoundingClientRect()
    const top = res.top
    const height = res.height
    this.setData({
      top,
      height
    })
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  },

  goBack() {
    wx.switchTab({
      url: '/pages/home/home',
    })
  },
})